# NewReferencePoint Method (Transform)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyItemFactory..::..NewReferencePoint Method (Transform)
FamilyItemFactory Class See Also
---
Create a reference point at a given location and with a given coordinate system in an Autodesk Revit family document.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ReferencePoint NewReferencePoint(
	Transform A_0
)
```

Visual Basic
---
```text
Public Function NewReferencePoint ( _
	A_0 As Transform _
) As ReferencePoint
```

Visual C++
---
```text
public:
ReferencePoint^ NewReferencePoint(
	Transform^ A_0
)
```

# ### Parameters
A_0
    Type: Autodesk.Revit.DB..::..Transform
# ### Return Value
The newly created ReferencePoint.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the argument is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the family is not a Conceptual Mass Family. |

# See Also
FamilyItemFactory Class
NewReferencePoint Overload
Autodesk.Revit.Creation Namespace